# Khi ng\u01B0\u1EDDi d\u00F9ng b\u1EAFt \u0111\u1EA7u l\u1EA1i (ho\u1EB7c ng\u00E0y \u0111\u1EA7u ti\u00EAn)
streak.day.1=Ch\u00E0o m\u1EEBng b\u1EA1n \u0111\u1EBFn v\u1EDBi bu\u1ED5i h\u1ECDc \u0111\u1EA7u ti\u00EAn! \uD83D\uDC96 B\u1EAFt \u0111\u1EA7u h\u00E0nh tr\u00ECnh th\u1EADt vui nh\u00E9. (\uC2DC\uC791\uC774 \uBC18\uC774\uB2E4! - B\u1EAFt \u0111\u1EA7u \u0111\u00E3 l\u00E0 m\u1ED9t n\u1EEDa th\u00E0nh c\u00F4ng)
# Khi ng\u01B0\u1EDDi d\u00F9ng l\u00E0m m\u1EA5t chu\u1ED7i
streak.lost=\u00D4i, ti\u1EBFc qu\u00E1! Chu\u1ED7i ng\u00E0y h\u1ECDc c\u1EE7a b\u1EA1n \u0111\u00E3 b\u1ECB ng\u1EAFt. \u0110\u1EEBng bu\u1ED3n (\uC2AC\uD37C\uD558\uC9C0 \uB9C8\uC138\uC694), m\u00ECnh l\u00E0m l\u1EA1i t\u1EEB \u0111\u1EA7u! C\u1ED1 l\u00EAn (\uC544\uC790 \uC544\uC790 \uD30C\uC774\uD305!) \uD83D\uDCAA
# --- C\u00E1c m\u1ED1c nh\u1ECF ---
streak.day.2=Tuy\u1EC7t v\u1EDDi (\uC88B\uC544\uC694!) B\u1EA1n \u0111\u00E3 duy tr\u00EC \u0111\u01B0\u1EE3c 2 ng\u00E0y li\u00EAn ti\u1EBFp. C\u1EE9 \u0111\u00E0 n\u00E0y ti\u1EBFn l\u00EAn nh\u00E9!
streak.day.3=Wow! 3 ng\u00E0y ch\u0103m ch\u1EC9! \uD83C\uDF38 B\u1EA1n \u0111ang t\u1EA1o ra m\u1ED9t th\u00F3i quen si\u00EAu t\u1ED1t \u0111\u00F3. (\uC815\uB9D0 \uC798\uD588\uC5B4\uC694! - L\u00E0m t\u1ED1t l\u1EAFm!)
streak.day.5=5 ng\u00E0y r\u1ED3i! B\u1EA1n th\u1EADt ki\u00EAn tr\u00EC. H\u00F4m nay m\u00ECnh h\u1ECDc ng\u1EEF ph\u00E1p m\u1EDBi nha? (\uACF5\uBD80\uD569\uC2DC\uB2E4! - C\u00F9ng h\u1ECDc n\u00E0o!)
# --- C\u00E1c m\u1ED1c quan tr\u1ECDng ---
streak.day.7=\uD83E\uDD73 CH\u00DAC M\u1EEANG 1 TU\u1EA6N! (\uCD95\uD558\uD574\uC694!) \uD83E\uDD73 B\u1EA1n \u0111\u00E3 h\u1ECDc t\u1EADp kh\u00F4ng ng\u1EEBng ngh\u1EC9 su\u1ED1t 7 ng\u00E0y. B\u1EA1n th\u1EADt \u0111\u00E1ng khen!
streak.day.10=S\u1ED1 10 \u0111\u1EB9p qu\u00E1! 10 ng\u00E0y n\u1ED7 l\u1EF1c c\u1EE7a b\u1EA1n th\u1EADt \u0111\u00E1ng ng\u01B0\u1EE1ng m\u1ED9. B\u1EA1n th\u1EA5y ti\u1EBFng H\u00E0n "d\u1EC5 th\u1EDF" h\u01A1n ch\u00FAt n\u00E0o ch\u01B0a?
streak.day.14=\u2728 2 TU\u1EA6N CH\u0102M CH\u1EC8! \u2728 T\u1EE5i m\u00ECnh t\u1EF1 h\u00E0o v\u1EC1 b\u1EA1n! B\u1EA1n \u0111ang ti\u1EBFn r\u1EA5t xa \u0111\u00F3! (\uD798\uB0B4\uC138\uC694! - C\u1ED1 l\u00EAn!)
streak.day.21=Ng\u01B0\u1EDDi ta n\u00F3i 21 ng\u00E0y \u0111\u1EC3 t\u1EA1o th\u00F3i quen. B\u1EA1n l\u00E0m \u0111\u01B0\u1EE3c r\u1ED3i! (\uD574\uB0C8\uC5B4!) \uD83D\uDC96 Th\u00F3i quen h\u1ECDc ti\u1EBFng H\u00E0n \u0111\u00E3 \u0111\u01B0\u1EE3c thi\u1EBFt l\u1EADp!
streak.day.30=\uD83D\uDE31 \u00D4 M\u00D4! (\uC5B4\uBA38!) 30 NG\u00C0Y! \uD83D\uDE31 M\u1ED9t th\u00E1ng tr\u1ECDn v\u1EB9n! B\u1EA1n l\u00E0 chi\u1EBFn binh th\u1EF1c th\u1EE5. (\uB300\uBC15! - Tuy\u1EC7t v\u1EDDi!)
# --- C\u00E1c m\u1ED1c l\u1EDBn ---
streak.day.50=50 NG\u00C0Y! Con s\u1ED1 \u1EA5n t\u01B0\u1EE3ng qu\u00E1! B\u1EA1n s\u1EAFp th\u00E0nh 'master' ti\u1EBFng H\u00E0n \u0111\u1EBFn n\u01A1i r\u1ED3i! (\uC815\uB9D0? - Th\u1EADt sao?)
streak.day.60=B\u1EA1n c\u00F3 bi\u1EBFt 60 ng\u00E0y l\u00E0 2 th\u00E1ng li\u00EAn t\u1EE5c kh\u00F4ng? B\u1EA1n si\u00EAu th\u1EADt! \uD83C\uDF1F (\uC644\uC804 \uC9F1!)
streak.day.90=90 ng\u00E0y! Ch\u1EC9 c\u00F2n 10 ng\u00E0y n\u1EEFa l\u00E0 ch\u1EA1m m\u1ED1c 100! \u0110\u1EC9nh qu\u00E1 b\u1EA1n \u01A1i!
streak.day.100=\uD83D\uDCAF TR\u0102M NG\u00C0Y! \uD83D\uDCAF B\u1EA1n c\u00F3 tin \u0111\u01B0\u1EE3c kh\u00F4ng? 100 ng\u00E0y ch\u0103m ch\u1EC9! B\u1EA1n l\u00E0 ngu\u1ED3n c\u1EA3m h\u1EE9ng cho t\u1EA5t c\u1EA3 m\u1ECDi ng\u01B0\u1EDDi! (\uCD5C\uACE0! - Tuy\u1EC7t nh\u1EA5t!)
# --- Th\u00F4ng b\u00E1o chung ---
streak.generic=Ng\u00E0y th\u1EE9 {0} r\u1EF1c r\u1EE1! \uD83D\uDD25 C\u1EE9 ti\u1EBFp t\u1EE5c gi\u1EEF l\u1EEDa h\u1ECDc t\u1EADp nha b\u1EA1n \u01A1i! (\uB9E4\uC77C \uB9E4\uC77C \uD30C\uC774\uD305!)
streak.generic.alt1=Chu\u1ED7i {0} ng\u00E0y r\u1ED3i! H\u00F4m nay b\u1EA1n mu\u1ED1n h\u1ECDc g\u00EC n\u00E0o? (\uBB50 \uBC30\uC6B8\uAE4C\uC694?) \uD83D\uDCDD
streak.generic.alt2={0} ng\u00E0y li\u00EAn ti\u1EBFp! B\u1EA1n th\u1EADt l\u00E0 m\u1ED9t ch\u00FA ong ch\u0103m ch\u1EC9! \uD83D\uDC1D (\uADC0\uC5EC\uC6CC\uC694! - D\u1EC5 th\u01B0\u01A1ng qu\u00E1!)
streak.common=H\u00E3y ti\u1EBFp t\u1EE5c duy tr\u00EC th\u00F3i quen h\u1ECDc t\u1EADp h\u00E0ng ng\u00E0y \u0111\u1EC3 \u0111\u1EA1t \u0111\u01B0\u1EE3c m\u1EE5c ti\u00EAu c\u1EE7a b\u1EA1n! (\uD654\uC774\uD305!)